app/controllers/users_controller.rb

  def index
    @users = User.select('id, name, email')
---
SELECT id, name, email FROM "users"

  def show
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("updated_at", "email", "name", "created_at", "password_hash") VALUES ('2011-08-10 15:52:08.644543', 'mike@mikepearce.net', 'Mike Pearce', '2011-08-10 15:52:08.644543', 'munk3h')

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = 1